#task 1
bite = (int(input("введите байты: " )))
bit = bite * 8 
print(bit)

#task 2

print("Электронная книга по программированию на английском языке состоит из A страниц.\n"
      "в среднем на странице B строк по C символов.\n"
      "Используется кодировка UTF-8. Определите объём текстового файла в Кбайтах")
A = int(input("Введите кол-во страниц: "))
B = int(input("Введите кол-во строк на странице: "))
C = int(input("Введите кол-во символов на странице: "))
print(f"Электронная книга по программированию на английском языке состоит из {A} страниц.\n"
      f"в среднем на странице {B} строк по {C} символов.\n"
      "\nИспользуется кодировка UTF-8. Определите объём текстового файла в Кбайтах")
all = A * B * C
Kb = all / 1024
print(f"{A} * {B} * {C} = {all} - Всего символов в книге")
print(f"{all} / 1024 = {Kb} - Кбайт. ")
print(f"Ответ: {Kb}.")
